#==============================================================================
# Deactivating scan related logic
#==============================================================================

set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_ssn_scan_host_sh_inst/tessent_persistent_cell_scan_en_buf/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_occ_kill_clock_en/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_observe_test_point_en/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_control_test_point_en/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_async_set_reset_static_disable/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_async_set_reset_static_disable/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_ltest_en/u_tc_lib_std_buf/Y}]
#set_case_analysis 1 [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_all_test/u_tc_lib_std_buf/Y}]
set_false_path -through [get_pins {lpddr_p_rtl2_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_all_test/u_tc_lib_std_buf/Y}]
set_case_analysis 1 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_adme_control2*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_adme_control1*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_adme_control0*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_kcs_control*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_pde_control*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_ret_control*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcsw_control*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcswr_control1*/u_tc_lib_std_buf/Y}]
set_case_analysis 1 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcswr_control0*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcsrd_control1*/u_tc_lib_std_buf/Y}]
set_case_analysis 1 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcsrd_control0*/u_tc_lib_std_buf/Y}]
set_case_analysis 0 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcs_control1*/u_tc_lib_std_buf/Y}]
set_case_analysis 1 [get_pins {u_lpddr_subsys_wrapper/snps_ddr_subsystem_inst/snps_ddr_subsystem_rtl1_tessent_tdr_sri_ctrl_inst/tessent_persistent_cell_mcs_control0*/u_tc_lib_std_buf/Y}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_ssn_scan_host_sh_inst/clock_gen/clock_signals/tessent_persistent_cell_test_clock_buf/o_clk}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_lpddr_clk_inst/tessent_persistent_cell_inject_tck_mux/i_clk0}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_lpddr_clk_inst/tessent_persistent_cell_inject_tck_mux/i_clk1}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_lpddr_clk_inst/tessent_persistent_cell_inject_tck_mux/i_sel}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_lpddr_clk_inst/tessent_persistent_cell_inject_tck_mux/o_clk}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_ao_clk_inst/tessent_persistent_cell_inject_tck_mux/i_clk0}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_ao_clk_inst/tessent_persistent_cell_inject_tck_mux/i_clk1}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_ao_clk_inst/tessent_persistent_cell_inject_tck_mux/i_sel}]
set_disable_timing [get_pins {lpddr_p_rtl2_tessent_occ_ao_clk_inst/tessent_persistent_cell_inject_tck_mux/o_clk}]
